wd500-usb3-cifs/fio-randread.log
job-randr: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randr;0;0;2097152;29392;7348;71350;1;11619;15.357407;39.610552;484;90107;4337.168125;5226.504769;1.000000%=2277;5.000000%=2539;10.000000%=2670;20.000000%=2867;30.000000%=2998;40.000000%=3162;50.000000%=3325;60.000000%=3555;70.000000%=3883;80.000000%=4423;90.000000%=5472;95.000000%=6455;99.000000%=34865;99.500000%=47972;99.900000%=63700;99.950000%=68681;99.990000%=76021;0%=0;0%=0;0%=0;502;90110;4352.793600;5229.558166;12184;40528;99.894385%;29360.957746;8542.695588;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;3.833270%;11.959523%;643288;0;42;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.25%;72.37%;25.03%;0.70%;1.20%;0.42%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randr: (groupid=0, jobs=1): err= 0: pid=679582: Mon Nov 23 23:11:45 2020
  read: IOPS=7348, BW=28.7MiB/s (30.1MB/s)(2048MiB/71350msec)
    slat (nsec): min=1690, max=11620k, avg=15357.41, stdev=39610.55
    clat (usec): min=484, max=90107, avg=4337.17, stdev=5226.50
     lat (usec): min=502, max=90110, avg=4352.79, stdev=5229.56
    clat percentiles (usec):
     |  1.00th=[ 2278],  5.00th=[ 2540], 10.00th=[ 2671], 20.00th=[ 2868],
     | 30.00th=[ 2999], 40.00th=[ 3163], 50.00th=[ 3326], 60.00th=[ 3556],
     | 70.00th=[ 3884], 80.00th=[ 4424], 90.00th=[ 5473], 95.00th=[ 6456],
     | 99.00th=[34866], 99.50th=[47973], 99.90th=[63701], 99.95th=[68682],
     | 99.99th=[76022]
   bw (  KiB/s): min=12184, max=40528, per=99.89%, avg=29360.96, stdev=8542.70, samples=142
   iops        : min= 3046, max=10132, avg=7340.21, stdev=2135.69, samples=142
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.25%, 4=72.37%, 10=25.03%, 20=0.70%, 50=1.20%
  lat (msec)   : 100=0.42%
  cpu          : usr=3.83%, sys=11.96%, ctx=643288, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=28.7MiB/s (30.1MB/s), 28.7MiB/s-28.7MiB/s (30.1MB/s-30.1MB/s), io=2048MiB (2147MB), run=71350-71350msec