wd500-usb3-cifs/fio-randwrite.log
job-randw: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randw;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;7252;1813;289148;2;12648;44.609628;73.476594;570;212473;17599.604815;15332.923943;1.000000%=1777;5.000000%=2277;10.000000%=2605;20.000000%=3162;30.000000%=4014;40.000000%=15663;50.000000%=19791;60.000000%=22151;70.000000%=23986;80.000000%=26345;90.000000%=30015;95.000000%=34865;99.000000%=90701;99.500000%=102236;99.900000%=112721;99.950000%=114819;99.990000%=198180;0%=0;0%=0;0%=0;600;212503;17644.797879;15344.952586;992;44848;100.000000%;7252.340830;8400.800016;1.550768%;7.074256%;319227;0;10;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;2.32%;27.54%;7.90%;14.82%;45.30%;1.54%;0.57%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randw: (groupid=0, jobs=1): err= 0: pid=676101: Mon Nov 23 23:10:28 2020
  write: IOPS=1813, BW=7253KiB/s (7427kB/s)(2048MiB/289148msec); 0 zone resets
    slat (usec): min=2, max=12648, avg=44.61, stdev=73.48
    clat (usec): min=570, max=212473, avg=17599.60, stdev=15332.92
     lat (usec): min=600, max=212503, avg=17644.80, stdev=15344.95
    clat percentiles (usec):
     |  1.00th=[  1778],  5.00th=[  2278], 10.00th=[  2606], 20.00th=[  3163],
     | 30.00th=[  4015], 40.00th=[ 15664], 50.00th=[ 19792], 60.00th=[ 22152],
     | 70.00th=[ 23987], 80.00th=[ 26346], 90.00th=[ 30016], 95.00th=[ 34866],
     | 99.00th=[ 90702], 99.50th=[102237], 99.90th=[112722], 99.95th=[114820],
     | 99.99th=[198181]
   bw (  KiB/s): min=  992, max=44848, per=100.00%, avg=7252.34, stdev=8400.80, samples=578
   iops        : min=  248, max=11212, avg=1813.05, stdev=2100.20, samples=578
  lat (usec)   : 750=0.01%, 1000=0.02%
  lat (msec)   : 2=2.32%, 4=27.54%, 10=7.90%, 20=14.82%, 50=45.30%
  lat (msec)   : 100=1.54%, 250=0.57%
  cpu          : usr=1.55%, sys=7.07%, ctx=319227, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=7253KiB/s (7427kB/s), 7253KiB/s-7253KiB/s (7427kB/s-7427kB/s), io=2048MiB (2147MB), run=289148-289148msec