wd500-usb3-cifs/fio-read.log
job-r: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
3;fio-3.16;job-r;0;0;2097152;40247;314;52107;2;2065;16.471626;25.792474;2862;252438;12701.172474;18180.901092;1.000000%=7372;5.000000%=8847;10.000000%=9371;20.000000%=9895;30.000000%=10158;40.000000%=10551;50.000000%=10813;60.000000%=11075;70.000000%=11468;80.000000%=11993;90.000000%=13172;95.000000%=14483;99.000000%=30539;99.500000%=221249;99.900000%=238026;99.950000%=242221;99.990000%=248512;0%=0;0%=0;0%=0;2891;252446;12718.011943;18181.083455;6912;50176;100.000000%;40249.817308;9876.989628;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.143937%;0.637163%;21760;0;139;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;23.39%;74.57%;1.21%;0.12%;0.69%;0.01%;0.00%;0.00%;0.00%;0.00%

job-r: (groupid=0, jobs=1): err= 0: pid=675295: Mon Nov 23 23:05:33 2020
  read: IOPS=314, BW=39.3MiB/s (41.2MB/s)(2048MiB/52107msec)
    slat (usec): min=2, max=2065, avg=16.47, stdev=25.79
    clat (msec): min=2, max=252, avg=12.70, stdev=18.18
     lat (msec): min=2, max=252, avg=12.72, stdev=18.18
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    9], 10.00th=[   10], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   12], 80.00th=[   12], 90.00th=[   14], 95.00th=[   15],
     | 99.00th=[   31], 99.50th=[  222], 99.90th=[  239], 99.95th=[  243],
     | 99.99th=[  249]
   bw (  KiB/s): min= 6912, max=50176, per=100.00%, avg=40249.82, stdev=9876.99, samples=104
   iops        : min=   54, max=  392, avg=314.43, stdev=77.15, samples=104
  lat (msec)   : 4=0.02%, 10=23.39%, 20=74.57%, 50=1.21%, 100=0.12%
  lat (msec)   : 250=0.69%, 500=0.01%
  cpu          : usr=0.14%, sys=0.64%, ctx=21760, majf=0, minf=139
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=39.3MiB/s (41.2MB/s), 39.3MiB/s-39.3MiB/s (41.2MB/s-41.2MB/s), io=2048MiB (2147MB), run=52107-52107msec